Repository: deepin-community/nemiver
Catalog: po/*.po
Languages: de

source: Nemiver is an on-going effort to write a standalone graphical debugger that integrates well in the GNOME desktop environment. It currently features a backend which uses the well known GNU Debugger gdb to debug C / C++ programs.
de: Nemiver ist eine fortlaufende Bemühung, eine eigenständige grafische Fehlerdiagnose zu erstellen, die sich gut in die GNOME-Arbeitsumgebung integriert. Es enthält derzeit ein Backend, das die bekannte GNU-Fehlerdiagnose gdb zum Diagnostizieren von C/C++-Programmen verwendet.

source: We believe that Nemiver is mature and robust enough to just let you debug your favorite C or C++ application in a pleasant way.
de: Wir sind überzeugt, dass Nemiver ausgereift und robust genug ist, so dass Sie Ihre Lieblings-C/C++-Anwendung bequem diagnostizieren können.

source: C/C++ Debugger
de: C/C++-Fehlerdiagnose

source: Nemiver C/C++ Debugger
de: Nemiver Fehlerdiagnose für C/C++

source: Debug Applications
de: Anwendungen diagnostizieren

source: gdb;disassembler;debugger;c;c++;
de: gdb;disassembler;debugger;Diagnose;c;c++;

source: Set the environment of the program to debug
de: Umgebung des zu diagnostizierenden Programms festlegen

source: Attach to a process
de: An einen Prozess anhängen

source: Load a core file
de: Core-Datei laden

source: List the saved debugging sessions
de: Gespeicherte Diagnose-Sitzungen auflisten

source: Erase the saved debugging sessions
de: Gespeicherte Diagnose-Sitzungen löschen

source: Debug the program that was of session number N
de: Programm mit Sitzungsnummer N diagnostizieren

source: Execute the last session
de: Letzte Sitzung ausführen

source: Enable logging domains DOMAINS
de: Protokollierungsdomänen DOMAINS anschalten

source: Log the debugger output
de: Diagnose-Ausgabe protokollieren

source: Use this terminal as the debugee's terminal
de: Dieses Terminal als Terminal zur Fehlerdiagnose verwenden

source: Connect to remote target specified by HOST:PORT
de: Zum entfernten Ziel verbinden, das mit HOST:PORT angegeben wurde

source: Where to look for shared libraries loaded by the inferior. Use in conjunction with --remote
de: Wo nach gemeinsamen Bibliotheken geschaut wird, die durch den Unterständigen geladen werden. Wird in Verbindung mit »--remote« verwendet.

source: Set the path of the GDB binary to use to debug the inferior
de: Den Pfad zum GDB-Binary angeben, das zum Diagnostizieren des Unterständigen verwendet wird

source: Do not set a breakpoint in 'main' and do not run the inferior either
de: Keinen Haltepunkt in »main« setzen und Unterständigen auch nicht ausführen

source: Show the version number of Nemiver
de: Die Versionsnummer von Nemiver anzeigen

source: A C/C++ debugger for GNOME
de: Eine C/C++-Diagnose für GNOME

source: Please provide a local copy of the binary you intend to debug remotely. Like this:
de: Bitte stellen Sie eine lokale Kopie der Binärdatei bereit, die Sie entfernt diagnostizieren möchten. Auf diese Weise:

source: Otherwise, find below the full set of Nemiver options.
de: Andernfalls finden Sie unten die vollständigen Einstellungen von Nemiver.

source: Please provide the path to the binary that generated the core file too. Like this:
de: Bitte geben Sie auch den Pfad zur Binärdatei an, welche die Core-Datei erzeugt hat. Auf diese Weise:

source: ID
de: Kennung

source: File Name
de: Dateiname

source: Line
de: Zeile

source: Function
de: Funktion

source: Address
de: Adresse

source: Condition
de: Bedingung

source: Toggle countpoint
de: _Zählpunkt setzen/entfernen

source: Type
de: Typ

source: Hits
de: Treffer

source: Expression
de: Ausdruck

source: Ignore count
de: Anzahl ignorieren

source: breakpoint
de: Haltepunkt

source: watchpoint
de: Überwachungspunkt

source: countpoint
de: Zählpunkt

source: unknown
de: unbekannt

source: _Delete
de: _Löschen

source: Remove this breakpoint
de: Diesen Haltepunkt entfernen

source: _Go to Source
de: _Gehe zu Quelldatei

source: Find this breakpoint in the source editor
de: Haltepunkt im Quelltext-Editor finden

source: _Copy
de: _Kopieren

source: Copy the call stack to the clipboard
de: Aufruf-Stack in die Zwischenablage kopieren

source: Arguments
de: Parameter

source: Location
de: Ort

source: Binary
de: Binär

source: (Click here to see the next %d row of the call stack
de: (Hier klicken, um die nächste %d Zeile des Aufruf-Stacks anzuzeigen)

source: Function Name
de: Funktionsname

source: Context
de: Kontext

source: Target Terminal
de: Ziel-Terminal

source: Breakpoints
de: Haltepunkte

source: Registers
de: Register

source: Memory
de: Speicher

source: Expression Monitor
de: Ausdrucksüberwachung

source: Reached end of file
de: Ende der Datei ist erreicht

source: Could not find string %s
de: Zeichenkette %s konnte nicht gefunden werden

source: Change to Standard Breakpoint
de: Zum vorgegebenen Haltepunkt ändern

source: Change to Countpoint
de: Zu Zählpunkt ändern

source: Remove _Breakpoint
de: Haltepunkt _entfernen

source: Disable Breakpoint
de: Haltepunkt deaktivieren

source: Enable Breakpoint
de: Haltepunkt aktivieren

source: Set _Breakpoint
de: _Haltepunkt setzen

source: Set Countpoint
de: Zählpunkt setzen

source: %s (path="%s", pid=%i)
de: %s (Pfad=»%s«, Kennung=%i)

source: Connected to remote target!
de: Verbindung zum entfernten Ziel hergestellt!

source: Program exited
de: Programm wurde beendet

source: The underlying debugger engine process died.
de: Der Prozess der darunterliegenden Diagnoseeinheit wurde beendet.

source: Target received a signal: %s, %s
de: Ziel erhielt ein Signal: %s, %s

source: An error occurred: %s
de: Ein Fehler ist aufgetreten: %s

source: File %s has been modified. Do you want to reload it?
de: Datei %s wurde geändert. Wollen Sie diese neu laden?

source: _Detach From the Running Program
de: Vom laufenden Programm _lösen

source: Disconnect the debugger from the running target without killing it
de: Diagnose vom laufenden Ziel lösen, ohne es abzuwürgen

source: _Save Session to Disk
de: Sitzung auf Platte _speichern

source: Save the current debugging session to disk
de: Die laufende Diagnose-Sitzung auf Platte speichern

source: _Run or Restart
de: Ausführen oder _Neustart

source: Run or Restart the target
de: Das Ziel ausführen oder neu starten

source: Set Breakpoint with Dialog...
de: Haltepunkt mittels Dialog setzen …

source: Set a breakpoint at the current line using a dialog
de: In der gegenwärtigen Zeile einen Haltepunkt mittels Dialog setzen

source: Set Breakpoint...
de: Haltepunkt setzen …

source: Set a breakpoint at a function or line number
de: In einer Funktion oder Zeilennummer einen Haltepunkt setzen

source: Toggle _Breakpoint
de: _Haltepunkt setzen/entfernen

source: Set/Unset a breakpoint at the current cursor location
de: An der jetzigen Cursor-Position einen Haltepunkt setzen/entfernen

source: Enable/Disable Breakpoint
de: Haltepunkt aktivieren/deaktivieren

source: Enable or disable the breakpoint that is set at the current cursor location
de: An der jetzigen Cursor-Position gesetzten Haltepunkt aktivieren/deaktivieren

source: Toggle _Countpoint
de: _Zählpunkt umschalten

source: Set/Unset a countpoint at the current cursor location
de: An der jetzigen Cursor-Position einen Zählpunkt setzen/entfernen

source: Set Watchpoint with Dialog...
de: Überwachungspunkt mittels Dialog setzen …

source: Set a watchpoint using a dialog
de: Überwachungspunkt mittels Dialog setzen

source: _Next
de: _Weiter

source: Execute next line stepping over the next function, if any
de: Nächste Zeile ausführen, die nächste Funktion überspringen, falls vorhanden

source: _Step
de: Einzel_schritt

source: Execute next line, stepping into the next function, if any
de: Nächste Zeile ausführen, in nächste Funktion springen, falls vorhanden

source: Step _Out
de: Heraus_springen

source: Finish the execution of the current function
de: Ausführung der aktuellen Funktion beenden

source: Step Into asm
de: Asm nachfolgen

source: Step into the next assembly instruction
de: Der nächsten Assembler-Anweisung nachfolgen

source: Step Over asm
de: Asm abarbeiten

source: Step over the next assembly instruction
de: Die nächste Assembler-Anweisung abarbeiten und überspringen

source: _Continue
de: _Fortsetzen

source: Continue program execution until the next breakpoint
de: Programmausführung bis zum nächsten Haltepunkt fortsetzen

source: Run to Cursor
de: Bis zum Cursor ausführen

source: Continue program execution until the currently selected line is reached
de: Programmausführung bis zur ausgewählten Zeile fortsetzen

source: Jump to Cursor
de: Zum Cursor springen

source: Jump to the currently selected line
de: Zur aktuell ausgewählten Zeile springen

source: Jump and Stop to Cursor
de: Bis zum Cursor springen und anhalten

source: Sets a breakpoint to the currently selected line and jump there
de: In der gegenwärtigen Zeile einen Haltepunkt setzen und dorthin springen

source: Jump to a Given Location
de: Zu einem angegebenen Ort springen

source: Select a given code location and jump there
de: Eine Codeposition auswählen und dorthin springen

source: Inspect an Expression
de: Einen Ausdruck untersuchen

source: Inspect a global or local expression
de: Globalen oder lokalen Ausdruck untersuchen

source: Call a Function
de: Eine Funktion aufrufen

source: Call a function in the program being debugged
de: Im zu diagnostizierenden Programm eine Funktion aufrufen

source: Show Global Variables
de: Alle globalen Variablen anzeigen

source: Display all global variables
de: Alle globalen Variablen anzeigen

source: Refresh Locals
de: Lokal auffrischen

source: Refresh the list of variables local to the current function
de: Variablenliste lokal zur aktuellen Funktion auffrischen

source: Show Assembly
de: Assembler anzeigen

source: Show the assembly code of the source code being currently debugged, in another tab
de: Den Assemblercode des Quelltextes, der gerade diagnostiziert wird, in einem neuen Reiter anzeigen

source: Switch to Assembly
de: Auf Assembleransicht umschalten

source: Show the assembly code of the source code being currently debugged
de: Den Assemblercode des Quelltextes anzeigen, der gerade diagnostiziert wird

source: Switch to Source
de: Auf Quellansicht umschalten

source: Show the source code being currently debugged
de: Den Quelltext anzeigen, der diagnostiziert wird

source: Stop
de: Anhalten

source: Stop the debugger
de: Diagnose anhalten

source: _View
de: _Ansicht

source: Switch to Target Terminal View
de: Auf Ziel-Terminalansicht umschalten

source: Switch to Context View
de: Auf Kontext-Ansicht umschalten

source: Switch to Breakpoints View
de: Auf Haltepunkt-Ansicht umschalten

source: Switch to Registers View
de: Auf Registeransicht umschalten

source: Switch to Memory View
de: Auf Speicheransicht umschalten

source: Switch to Variables Monitor View
de: Auf die Ansicht der Variablenüberwachung umschalten

source: _Debug
de: _Diagnose

source: _Open Source File...
de: _Quelldatei öffnen …

source: Open a source file for viewing
de: Quelldatei zur Ansicht öffnen

source: Load _Executable...
de: _Ausführen …

source: Execute a program
de: Ein Programm ausführen

source: _Load Core File...
de: Core-Datei _laden …

source: Load a core file from disk
de: Core-Datei von Platte laden

source: _Attach to Running Program...
de: An ein laufendes Programm an_hängen …

source: Debug a program that's already running
de: Bereits laufendes Programm diagnostizieren

source: _Connect to Remote Target...
de: Mit entferntem Ziel _verbinden …

source: Connect to a debugging server to debug a remote target
de: Zum Diagnostizieren eines entfernten Ziels eine Verbindung zu einem Diagnose-Server herstellen

source: Resume Sa_ved Session...
de: Gespeicherte Sitzung _wiederherstellen...

source: Open a previously saved debugging session
de: Eine vorher gespeicherte Diagnose-Sitzung öffnen

source: _Preferences
de: _Einstellungen

source: Edit the properties of the current session
de: Einstellungen der laufenden Sitzungen bearbeiten

source: _Copy selected text
de: Den markierten Text _kopieren

source: Copy the text selected in the current source file
de: Den markierten Text in der aktuellen Quelldatei kopieren

source: _Reload Source File
de: Quelldatei neu _laden

source: Reloads the source file
de: Lädt die Quelldatei neu

source: _Close Source File
de: _Quelldatei schlieẞen

source: Close the opened file
de: Offene Datei schlieẞen

source: _Find
de: _Suchen

source: Find a text string in file
de: Text-Zeichenkette in Datei suchen

source: Close %s
de: %s s_chlieẞen

source: Sorry, it's impossible to restart a remote inferior
de: Entschuldigung, aber es ist unmöglich, einen entfernten Unterständigen neu zu starten.

source: Could not find file %s
de: Datei »%s« konnte nicht gefunden werden

source: Could not load program: %s
de: Das Programm konnte nicht geladen werden: %s

source: You cannot attach to Nemiver itself
de: Sie können nicht an Nemiver selbst anhängen

source: You cannot attach to the underlying debugger engine
de: Sie können nicht an die darunterliegende Diagnoseeinheit anhängen

source: Failed to stop the debugger
de: Diagnose konnte nicht angehalten werden

source: Invalid line number: %i
de: Ungültige Zeilennummer: %i

source: There is a program being currently debugged. Do you really want to exit from the debugger?
de: Die Diagnose für ein Programm läuft derzeit. Wollen Sie die Diagnose wirklich verlassen?

source: Default Layout
de: Vorgabeansicht

source: Nemiver's default layout
de: Vorgabeansicht von Nemiver

source: Source Code
de: Quelltext

source: Dynamic Layout
de: Dynamische Ansicht

source: A layout which can be modified
de: Eine anpassbare Ansicht

source: Two Status Pane
de: Zwei Statusleisten

source: A layout with two status pane
de: Eine Ansicht mit zwei Statusleisten

source: Wide Layout
de: Breite Ansicht

source: A layout for very large monitors
de: Eine Ansicht für sehr große Bildschirme

source: Expand _Selected
de: Au_gewählte ausklappen

source: Expand _All
de: _Alle ausklappen

source: _Collapse
de: Ein_klappen

source: Loading files from target executable...
de: Dateien des ausführbaren Ziels werden geladen …

source: Variable type is: %s
de: Variablentyp ist: %s

source: Local Variables
de: Lokale Variablen

source: Function Arguments
de: Funktionsargumente

source: _Copy Variable Name
de: Variablenname ko_pieren

source: Copy the variable path expression to the clipboard
de: Variablenpfad-Ausdruck in die Zwischenablage kopieren

source: _Copy Variable Value
de: Variablenwert _kopieren

source: Copy the variable value to the clipboard
de: Variablenwert in die Zwischenablage kopieren

source: Create Watchpoint
de: Überwachungspunkt erzeugen

source: Create a watchpoint that triggers when the value of the expression changes
de: Einen Überwachungspunkt erzeugen, welcher auslöst, wenn sich der Wert des Ausdrucks ändert

source: Word
de: Wort

source: Long Word
de: Langes Wort

source: Address:
de: Adresse:

source: Show
de: Zeigen

source: Group By:
de: Gruppieren nach:

source: Choose a Directory
de: Ordner auswählen

source: Source Directories
de: Quellordner

source: User Name
de: Benutzername

source: Value
de: Wert

source: Session
de: Sitzung

source: Throw Exception
de: Ausnahme verwerfen

source: Catch Exception
de: Ausnahme empfangen

source: Fork System Call
de: Systemaufruf fork()

source: Vfork System Call
de: Systemaufruf vfork()

source: Exec System Call
de: Systemaufruf exec()

source: Thread ID
de: Thread-Kennung

source: In scope expressions
de: Ausdrücke innerhalb des Bereichs

source: Out of scope expressions
de: Ausdrücke außerhalb des Bereichs

source: Remove
de: Entfernen

source: Remove selected expressions from the monitor
de: Ausgewählte Ausdrücke aus der Überwachung entfernen

source: New...
de: Neu …

source: Add a new expression to the monitor
de: Einen neuen Ausdruck zur Überwachung hinzufügen

source: Call a function:
de: Eine Funktion aufrufen:

source: Set Breakpoint
de: Haltepunkt setzen

source: Choose Overloaded Function
de: Überladene Funktion wählen

source: Multiple functions match the specified name. Please choose one from the list below.
de: Mehrere Funktionen stimmen mit dem angegebenen Namen überein. Bitte wählen Sie eine Funktion aus der nachfolgenden Liste.

source: Find Text
de: Text suchen

source: _Search:
de: _Suchen:

source: Match Options:
de: Übereinstimmungsoptionen:

source: Match c_ase
de: Gr_oẞ/Kleinschreibung berücksichtigen

source: Match _entire word only
de: Nur ganz_e Wörter

source: Cycling Options:
de: Durchlaufoptionen:

source: _Wrap around
de: _Zeilenumbruch

source: Search _backwards
de: _Rückwärts suchen

source: Global Variables
de: Globale Variablen

source: Choose a Core File to Debug
de: Core-Datei zum Diagnostizieren wählen

source: Select a Core File
de: Eine Core-Datei auswählen

source: Core File:
de: Core-Datei:

source: Select the executable that created the core file
de: Ausführbare Datei wählen, welche die Core-Datei erzeugt hat

source: Executable:
de: Ausführbare Datei:

source: Open Source Files
de: Quelldateien öffnen

source: Select from _Target Executable
de: Aus _ausführbarem Ziel wählen

source: Select from _File System
de: Im _Dateisystem auswählen

source: Choose Source Files to Open
de: Quelldateien zum Öffnen auswählen

source: Preferences
de: Einstellungen

source: Use system monospace font
de: Dicktengleiche Schrift des Systems verwenden

source: Custom Font:
de: Benutzerdefinierte Schrift:

source: Editor Font
de: Editor-Schrift

source: Visual Style
de: Erscheinungsbild

source: Display line numbers
de: Zeilennummern anzeigen

source: Line Numbers
de: Zeilennummern

source: Use launch terminal
de: Terminal verwenden

source: When a source file is changed:
de: Beim Ändern einer Quelldatei:

source: Reload the file
de: Datei neu laden

source: Do not reload the file
de: Datei nicht neu laden

source: Ask each time
de: Jedes Mal nachfragen

source: File Monitoring
de: Dateiüberwachung

source: Enable syntax highlighting
de: Syntax-Hervorhebung aktivieren

source: Syntax Highlighting
de: Syntax-Hervorhebung

source: Update at each stop
de: Bei jedem Halt aktualisieren

source: Local variables
de: Lokale Variablen

source: Pure assembly
de: Reines Assembler

source: Mixed source and assembly
de: Quelle und Assembler gemischt

source: Assembly style
de: Assemblerstil

source: Assembly flavor
de: Assembler-Variante

source: Choose a File
de: Datei auswählen

source: Path to the GDB binary used
de: Pfad zur verwendeten GDB-Binärdatei

source: GDB Binary
de: GDB-Binärdatei

source: Number of instructions to disassemble by default
de: Voreingestellte Anzahl der Anweisungen, die disassembliert werden sollen

source: Instructions
de: Anweisungen

source: Enable pretty printing (requires debugger restart)
de: Quellcodeformatierung aktivieren (Neustart der Diagnose erforderlich)

source: GDB Pretty Printing
de: GDB-Quellcodeformatierung

source: Follow parent
de: Elternprozess folgen

source: Follow child
de: Kindprozess folgen

source: GDB Follow Fork Mode
de: GDB-Modus »fork folgen«

source: Debugger
de: Diagnose

source: Layout
de: Ansicht

source: Attach to a Running Program
de: An ein laufendes Programm anhängen

source: Choose a Process to Debug
de: Einen Prozess zum Diagnostizieren auswählen

source: _Filter list:
de: _Filterliste:

source: Connect to Remote Target
de: Zum entfernten Ziel verbinden

source: Executable to Load
de: Zu ladende ausführbare Datei

source: Shared Libraries Location
de: Ort der gemeinsam genutzten Bibliotheken

source: Remote Debugging Server
de: Entfernter Diagnose-Server

source: TCP/IP Connection
de: TCP/IP-Verbindung

source: Serial Line Connection
de: Serielle Verbindung

source: Choose a Program to Execute
de: Programm zum Ausführen auswählen

source: Choose an Executable
de: Ausführbare Datei wählen

source: Program:
de: Programm:

source: Arguments:
de: Parameter:

source: Choose a Working Directory
de: Arbeitsordner wählen

source: Working Directory:
de: Arbeitsordner:

source: _Add
de: _Hinzufügen

source: _Remove
de: _Entfernen

source: Environment Variables:
de: Umgebungsvariablen:

source: Saved Sessions
de: Gespeicherte Sitzungen

source: Choose a Session to Debug
de: Sitzung zum Diagnostizieren auswählen

source: Set a Breakpoint:
de: Haltepunkt setzen:

source: Condition:
de: Bedingung:

source: _Event:
de: _Ereignis:

source: _Binary Location:
de: Ort der _Binärdatei

source: _Source Location:
de: _Quellort:

source: F_unction Name:
de: F_unktionsname:

source: File name:
de: Dateiname:

source: Function:
de: Funktion:

source: Line:
de: Zeile:

source: Set as Countpoint
de: Als Zählpunkt setzen

source: Set Location to Jump To
de: Zielposition auswählen

source: Jump to location:
de: Springen zur Position:

source: Break at Destination
de: Haltepunkt am Ziel

source: Add to monitor
de: Zur Überwachung hinzufügen

source: _Variable Name:
de: _Variablenname:

source: _Inspect
de: _Untersuchen

source: Set a watchpoint:
de: Überwachungspunkt setzen:

source: Expression:
de: Ausdruck:

source: Inspect
de: Untersuchen

source: Triggers on:
de: Löst aus bei:

source: Read
de: Lesen

source: Write
de: Schreiben

source: Select Location for %s
de: Ort für %s auswählen

source: Cannot find file '%s'. Please specify the location of this file:
de: Datei »%s« kann nicht gefunden werden. Bitte geben Sie den Ort dieser Datei an:

source: Line: %i, Column: %i
de: Zeile: %i, Spalte: %i

source: Could not load file %s because its encoding is different from %s
de: Datei %s kann nicht geladen werden, da sich die Kodierung von %s unterscheidet

source: Copy the selection
de: Die Auswahl kopieren

source: _Paste
de: _Einfügen

source: Paste the clipboard
de: Inhalt der Zwischenablage einfügen

source: _Reset
de: _Neustart

source: Reset the terminal
de: Das Terminal zurücksetzen

source: Do not ask me again
de: Nicht wieder nachfragen

source: Project Website
de: Projekt-Webseite

source: translator-credits
de: Carsten Reith <carsten.reith@arcor.de> Mario Blättermann <mario.blaettermann@gmail.com> Christian Kirbach <christian.kirbach@googlemail.com> Jakob Kramer <jakob.kramer@gmx.de>

source: _File
de: _Datei

source: _Quit
de: _Beenden

source: Quit the application
de: Die Anwendung beenden

source: _Edit
de: _Bearbeiten

source: _Help
de: _Hilfe

source: _About
de: _Info

source: Display information about this application
de: Info zu dieser Anwendung anzeigen

source: _Contents
de: _Inhalte

source: Display the user manual for this application
de: Benutzerhandbuch zu dieser Anwendung öffnen

source: Select File Location
de: Ort der Datei auswählen

source: Locate File
de: Datei angeben
